/*============================================================================================
 *
 *  (C) 2010, Phyton
 *
 *  Демонстрационный проект для 1986BE91 testboard
 *
 *  Данное ПО предоставляется "КАК ЕСТЬ", т.е. исключительно как пример, призванный облегчить
 *  пользователям разработку их приложений для процессоров Milandr 1986BE91T1. Компания Phyton
 *  не несет никакой ответственности за возможные последствия использования данного, или
 *  разработанного пользователем на его основе, ПО.
 *
 *--------------------------------------------------------------------------------------------
 *
 *  Файл font_defs.h: Описание экранных шрифтов
 *
 *============================================================================================*/

#ifndef __FONT_DEFS_H
#define __FONT_DEFS_H

/*--------------------------------------------------------------------------------------------*/
/* Структура описания шрифта.                                                                 */

typedef struct tag_FONT {
    unsigned Height;            /* Высота символа в пикселях. */
    unsigned Width;             /* Ширина символа в пикселях. */
    unsigned Count;             /* Число символов в шрифте минус один. */
    const unsigned char *pData; /* Адрес таблицы с описанием символов шрифта. */
} FONT;

/*--------------------------------------------------------------------------------------------*/
/* Шрифты                                                                                     */

extern FONT Font_6x8;           /* 6  х 8  пикселей             */
extern FONT Font_7x10_thin;     /* 7  х 10 пикселей тонкий      */
extern FONT Font_7x10_bold;     /* 7  х 10 пикселей утолщенный  */
extern FONT Font_12x16;         /* 12 х 16 пикселей             */

#endif /* __FONT_DEFS_H */

/*============================================================================================
 * Конец файла font_defs.h
 *============================================================================================*/
