/*============================================================================================
 *
 *  (C) 2010, Phyton
 *
 *  Демонстрационный проект для 1986BE91 testboard
 *
 *  Данное ПО предоставляется "КАК ЕСТЬ", т.е. исключительно как пример, призванный облегчить
 *  пользователям разработку их приложений для процессоров Milandr 1986BE91T1. Компания Phyton
 *  не несет никакой ответственности за возможные последствия использования данного, или
 *  разработанного пользователем на его основе, ПО.
*
 *--------------------------------------------------------------------------------------------
 *
 *  Файл gl.h: Вывод графических примитивов на LCD-экран
 *
 *============================================================================================*/

#ifndef __GL_H
#define __GL_H

void LCD_PutPixel(unsigned x, unsigned y);
void LCD_Line(unsigned x1, unsigned y1, unsigned x2, unsigned y2);
void LCD_Circle(unsigned xc, unsigned yc, unsigned r);

#endif /* __GL_H */

/*============================================================================================
 * Конец файла gl.h
 *============================================================================================*/
