/*============================================================================================
 *
 *  (C) 2010, Phyton
 *
 *  Демонстрационный проект для 1986BE91 testboard
 *
 *  Данное ПО предоставляется "КАК ЕСТЬ", т.е. исключительно как пример, призванный облегчить
 *  пользователям разработку их приложений для процессоров Milandr 1986BE91T1. Компания Phyton
 *  не несет никакой ответственности за возможные последствия использования данного, или
 *  разработанного пользователем на его основе, ПО.
 *
 *--------------------------------------------------------------------------------------------
 *
 *  Файл leds.c: Работа со светодиодами
 *
 *============================================================================================*/

#include <runtime/lib.h>

#include "leds.h"
#include "lcd.h"
#include "text.h"
#include "joystick.h"
#include "menu.h"

/* Маска включенных светодиодов */
unsigned CurrentLights;

/* Сервисные утилиты */

void InitPortLED(void) {
    ARM_GPIOD->FUNC   &= ~((0x3FF << (LED0_OFS << 1))); /* Port */
    ARM_GPIOD->ANALOG |= LEDS_MASK;                     /* Digital */
    ARM_GPIOD->PWR    |= (0x155 << (LED0_OFS << 1));    /* Slow */
    ARM_GPIOD->DATA   &= ~LEDS_MASK;
    ARM_GPIOD->OE     |= LEDS_MASK;
}

void ShiftLights(void) {
    unsigned ovf;
    ARM_GPIOD->DATA = (ARM_GPIOD->DATA & ~LEDS_MASK) | (CurrentLights & LEDS_MASK);
    ovf = (CurrentLights & (1UL << 31)) != 0;
    CurrentLights <<= 1;
    CurrentLights |= ovf;
}

/*============================================================================================
 * Конец файла leds.c
 *============================================================================================*/
