/*============================================================================================
 *
 *  (C) 2010, Phyton
 *
 *  Демонстрационный проект для 1986BE91 testboard
 *
 *  Данное ПО предоставляется "КАК ЕСТЬ", т.е. исключительно как пример, призванный облегчить
 *  пользователям разработку их приложений для процессоров Milandr 1986BE91T1. Компания Phyton
 *  не несет никакой ответственности за возможные последствия использования данного, или
 *  разработанного пользователем на его основе, ПО.
 *
 *--------------------------------------------------------------------------------------------
 *
 *  Файл Main.c
 *
 *============================================================================================*/

#include <runtime/lib.h>

#include "lcd.h"
#include "gl.h"
#include "text.h"
#include "joystick.h"
#include "leds.h"
#include "menu.h"

int main(void) {
    LCD_INIT();
    InitPortLED();
    Menu_Init();
    DisplayMenu();
    ReadKey();
    return 0;
}

/*============================================================================================
 * Конец файла Main.c
 *============================================================================================*/
